//Задача 1.1.1
//
// Напишите программу, которая печатает в консоль две строки:
//   1. Hello ITMan!
//   2. I will be a programmer!
//
// Формат входных данных:
//  Входные данные отсутствуют.
//
// Формат выходных данных:
//  2 фразы, требуемые по условию задачи, каждая с новой строки.



public class MyClass {
    public static void main(String args[]) {
     
      System.out.println("Hello ITMan!");
      System.out.println("I will be a programmer!");
    }
}