//Задача 1.1.2
//
// Напишите программу, которая печатает в консоль три строки:
//   1. Hooray!
//   2. I finished the first lesson.
//   3. And now I can print strings.
//
// Формат входных данных:
//  Входные данные отсутствуют.
//
// Формат выходных данных:
//  3 фразы, требуемые по условию задачи, каждая с новой строки.



public class MyClass {
    public static void main(String args[]) {
     
      System.out.println("Hooray!");
      System.out.println("I finished the first lesson.");
      System.out.println("And now I can print strings.");
    }
}