//Задача 1.2.1
//
// Напишите программу, которая печатает 5 значений, каждое с новой строки:
//   1. Строку String
//   2. Целое число 10
//   3. Вещественное число 3,14
//   4. Логическое значение true
//   5. Логическое значение false
//
// Формат входных данных:
//  Входные данные отсутствуют.
//
// Формат выходных данных:
//  5 сторок, состоящие из значений, требуемые по условию задачи.




public class MyClass {
    public static void main(String args[]) {
     
      System.out.println("String");
      System.out.println(10);
      System.out.println(3.14);
      System.out.println(true);
      System.out.println(false);
    }
}